OpenFOAM_Benchmarks/dambreakGomez/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    leftWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    rightWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    rearWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leftWallColumn
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    rightWallColumn
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontWallColumn
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    rearWallColumn
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }    
    
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
