OpenFOAM_Benchmarks/dambreakGomez/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (0.9 0 0)
    (1.02 0 0)
    (1.6 0 0)
    (0 0.75 0)
    (0.9 0.75 0)
    (1.02 0.75 0)
    (1.6 0.75 0)
    
    (0 0 0.25)
    (0.9 0 0.25)
    (1.02 0 0.25)
    (1.6 0 0.25)
    (0 0.75 0.25)
    (0.9 0.75 0.25)
    (1.02 0.75 0.25)
    (1.6 0.75 0.25) 
    
    (0 0 0.37)
    (0.9 0 0.37)
    (1.02 0 0.37)
    (1.6 0 0.37)
    (0 0.75 0.37)
    (0.9 0.75 0.37)
    (1.02 0.75 0.37)
    (1.6 0.75 0.37)
    
    (0 0 0.61)
    (0.9 0 0.61)
    (1.02 0 0.61)
    (1.6 0 0.61)
    (0 0.75 0.61)
    (0.9 0.75 0.61)
    (1.02 0.75 0.61)
    (1.6 0.75 0.61)                                  
);

blocks          
(
    hex (0 1 5 4 8 9 13 12) (150 124 42) simpleGrading (1 1 1)
    hex (8 9 13 12 16 17 21 20) (150 124 20) simpleGrading (1 1 1)
    hex (16 17 21 20 24 25 29 28) (150 124 40) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) (20 124 42) simpleGrading (1 1 1)
    hex (17 18 22 21 25 26 30 29) (20 124 40) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (96 124 42) simpleGrading (1 1 1)
    hex (10 11 15 14 18 19 23 22) (96 124 20) simpleGrading (1 1 1)   
    hex (18 19 23 22 26 27 31 30) (96 124 40) simpleGrading (1 1 1)
);

edges           
(
);

patches
(
    wall leftWall
        (
            (0 8 12 4)
            (8 16 20 12)
            (16 24 28 20)
        )
    wall rightWall
        (
            (3 7 15 11)
            (11 15 23 19)
            (19 23 31 27)
        )
    wall lowerWall
        (
            (0 1 9 8)
            (8 9 17 16)
            (16 17 25 24)
            (1 2 10 9)
            (17 18 26 25)
            (2 3 11 10)
            (10 11 19 18)
            (18 19 27 26)
        )
    wall frontWall
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
        )
    wall rearWall
        (
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        )     
    wall leftWallColumn
        (
            (9 13 21 17)
        )
    wall rightWallColumn
        (
            (10 18 22 14)
        )
    wall frontWallColumn
        (
            (9 10 14 13)
        )
    wall rearWallColumn
        (
            (17 18 22 21)
        ) 
                       
    patch atmosphere
        (
            (4 12 13 5)
            (12 20 21 13)
            (20 28 29 21)
            (6 14 15 7)
            (14 22 23 15)
            (22 30 31 23)
            (5 13 14 6)
            (21 29 30 22)
        )
);

mergePatchPairs
(
);

// ************************************************************************* //
