OpenFOAM_Benchmarks/dambreakGomez/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;

maxDeltaT       1;

libs ( "libOpenFOAM.so" ) ;

functions
{
    probes
        {
            // Where to load it from
            functionObjectLibs ( "libsampling.so" );
    
            type        probes;
    
            // Name of the directory for probe data
            name        probes;
            probeLocations
            (
(	1.026	0.001	0.27	)			
(	1.026	0.025	0.27	)			
(	1.026	0.049	0.27	)				
(	1.026	0.073	0.27	)				
(	1.026	0.097	0.27	)				
(	1.026	0.121	0.27	)				
(	1.026	0.145	0.27	)				
(	1.026	0.169	0.27	)				
(	1.026	0.193	0.27	)				
(	1.026	0.217	0.27	)				
(	1.026	0.241	0.27	)				
(	1.026	0.265	0.27	)				
(	1.026	0.289	0.27	)				
(	1.026	0.313	0.27	)				
(	1.026	0.337	0.27	)				
(	1.026	0.361	0.27	)				
(	1.026	0.385	0.27	)				
(	1.026	0.409	0.27	)				
(	1.026	0.433	0.27	)				
(	1.026	0.457	0.27	)				
(	1.026	0.481	0.27	)				
(	1.026	0.505	0.27	)				
(	1.026	0.529	0.27	)				
(	1.026	0.553	0.27	)				
(	1.026	0.577	0.27	)				
(	1.026	0.601	0.27	)				
(	1.026	0.625	0.27	)				
(	1.026	0.649	0.27	)				
(	1.026	0.673	0.27	)				
(	1.026	0.697	0.27	)				
(	1.026	0.721	0.27	)				
(	1.026	0.745	0.27	)				
								
(	1.026	0.001	0.29	)				
(	1.026	0.025	0.29	)				
(	1.026	0.049	0.29	)				
(	1.026	0.073	0.29	)				
(	1.026	0.097	0.29	)				
(	1.026	0.121	0.29	)				
(	1.026	0.145	0.29	)				
(	1.026	0.169	0.29	)				
(	1.026	0.193	0.29	)				
(	1.026	0.217	0.29	)				
(	1.026	0.241	0.29	)				
(	1.026	0.265	0.29	)				
(	1.026	0.289	0.29	)				
(	1.026	0.313	0.29	)				
(	1.026	0.337	0.29	)				
(	1.026	0.361	0.29	)				
(	1.026	0.385	0.29	)				
(	1.026	0.409	0.29	)				
(	1.026	0.433	0.29	)				
(	1.026	0.457	0.29	)				
(	1.026	0.481	0.29	)				
(	1.026	0.505	0.29	)				
(	1.026	0.529	0.29	)				
(	1.026	0.553	0.29	)				
(	1.026	0.577	0.29	)				
(	1.026	0.601	0.29	)				
(	1.026	0.625	0.29	)				
(	1.026	0.649	0.29	)				
(	1.026	0.673	0.29	)				
(	1.026	0.697	0.29	)				
(	1.026	0.721	0.29	)				
(	1.026	0.745	0.29	)				
								
								
(	1.026	0.001	0.31	)				
(	1.026	0.025	0.31	)				
(	1.026	0.049	0.31	)				
(	1.026	0.073	0.31	)				
(	1.026	0.097	0.31	)				
(	1.026	0.121	0.31	)				
(	1.026	0.145	0.31	)				
(	1.026	0.169	0.31	)				
(	1.026	0.193	0.31	)				
(	1.026	0.217	0.31	)				
(	1.026	0.241	0.31	)				
(	1.026	0.265	0.31	)				
(	1.026	0.289	0.31	)				
(	1.026	0.313	0.31	)				
(	1.026	0.337	0.31	)				
(	1.026	0.361	0.31	)				
(	1.026	0.385	0.31	)				
(	1.026	0.409	0.31	)				
(	1.026	0.433	0.31	)				
(	1.026	0.457	0.31	)				
(	1.026	0.481	0.31	)				
(	1.026	0.505	0.31	)				
(	1.026	0.529	0.31	)				
(	1.026	0.553	0.31	)				
(	1.026	0.577	0.31	)				
(	1.026	0.601	0.31	)				
(	1.026	0.625	0.31	)				
(	1.026	0.649	0.31	)				
(	1.026	0.673	0.31	)				
(	1.026	0.697	0.31	)				
(	1.026	0.721	0.31	)				
(	1.026	0.745	0.31	)				
								
(	1.026	0.001	0.33	)				
(	1.026	0.025	0.33	)				
(	1.026	0.049	0.33	)				
(	1.026	0.073	0.33	)				
(	1.026	0.097	0.33	)				
(	1.026	0.121	0.33	)				
(	1.026	0.145	0.33	)				
(	1.026	0.169	0.33	)				
(	1.026	0.193	0.33	)				
(	1.026	0.217	0.33	)				
(	1.026	0.241	0.33	)				
(	1.026	0.265	0.33	)				
(	1.026	0.289	0.33	)				
(	1.026	0.313	0.33	)				
(	1.026	0.337	0.33	)				
(	1.026	0.361	0.33	)				
(	1.026	0.385	0.33	)				
(	1.026	0.409	0.33	)				
(	1.026	0.433	0.33	)				
(	1.026	0.457	0.33	)				
(	1.026	0.481	0.33	)				
(	1.026	0.505	0.33	)				
(	1.026	0.529	0.33	)				
(	1.026	0.553	0.33	)				
(	1.026	0.577	0.33	)				
(	1.026	0.601	0.33	)				
(	1.026	0.625	0.33	)				
(	1.026	0.649	0.33	)				
(	1.026	0.673	0.33	)				
(	1.026	0.697	0.33	)				
(	1.026	0.721	0.33	)				
(	1.026	0.745	0.33	)				
								
(	1.026	0.001	0.35	)				
(	1.026	0.025	0.35	)				
(	1.026	0.049	0.35	)				
(	1.026	0.073	0.35	)				
(	1.026	0.097	0.35	)				
(	1.026	0.121	0.35	)				
(	1.026	0.145	0.35	)				
(	1.026	0.169	0.35	)				
(	1.026	0.193	0.35	)				
(	1.026	0.217	0.35	)				
(	1.026	0.241	0.35	)				
(	1.026	0.265	0.35	)				
(	1.026	0.289	0.35	)				
(	1.026	0.313	0.35	)				
(	1.026	0.337	0.35	)				
(	1.026	0.361	0.35	)				
(	1.026	0.385	0.35	)				
(	1.026	0.409	0.35	)				
(	1.026	0.433	0.35	)				
(	1.026	0.457	0.35	)				
(	1.026	0.481	0.35	)				
(	1.026	0.505	0.35	)				
(	1.026	0.529	0.35	)				
(	1.026	0.553	0.35	)				
(	1.026	0.577	0.35	)				
(	1.026	0.601	0.35	)				
(	1.026	0.625	0.35	)				
(	1.026	0.649	0.35	)				
(	1.026	0.673	0.35	)				
(	1.026	0.697	0.35	)				
(	1.026	0.721	0.35	)				
(	1.026	0.745	0.35	)				
(	1.026	0.001	0.35	)				
(	1.026	0.025	0.35	)				
(	1.026	0.049	0.35	)				
(	1.026	0.073	0.35	)				
(	1.026	0.097	0.35	)				
(	1.026	0.121	0.35	)				
(	1.026	0.145	0.35	)				
(	1.026	0.169	0.35	)				
(	1.026	0.193	0.35	)				
(	1.026	0.217	0.35	)				
(	1.026	0.241	0.35	)				
(	1.026	0.265	0.35	)				
(	1.026	0.289	0.35	)				
(	1.026	0.313	0.35	)				
(	1.026	0.337	0.35	)				
(	1.026	0.361	0.35	)				
(	1.026	0.385	0.35	)				
(	1.026	0.409	0.35	)				
(	1.026	0.433	0.35	)				
(	1.026	0.457	0.35	)				
(	1.026	0.481	0.35	)				
(	1.026	0.505	0.35	)				
(	1.026	0.529	0.35	)				
(	1.026	0.553	0.35	)				
(	1.026	0.577	0.35	)				
(	1.026	0.601	0.35	)				
(	1.026	0.625	0.35	)				
(	1.026	0.649	0.35	)				
(	1.026	0.673	0.35	)				
(	1.026	0.697	0.35	)				
(	1.026	0.721	0.35	)				
(	1.026	0.745	0.35	)				
								
(	0.894	0.001	0.27	)				
(	0.894	0.025	0.27	)				
(	0.894	0.049	0.27	)				
(	0.894	0.073	0.27	)				
(	0.894	0.097	0.27	)				
(	0.894	0.121	0.27	)				
(	0.894	0.145	0.27	)				
(	0.894	0.169	0.27	)				
(	0.894	0.193	0.27	)				
(	0.894	0.217	0.27	)				
(	0.894	0.241	0.27	)				
(	0.894	0.265	0.27	)				
(	0.894	0.289	0.27	)				
(	0.894	0.313	0.27	)				
(	0.894	0.337	0.27	)				
(	0.894	0.361	0.27	)				
(	0.894	0.385	0.27	)				
(	0.894	0.409	0.27	)				
(	0.894	0.433	0.27	)				
(	0.894	0.457	0.27	)				
(	0.894	0.481	0.27	)				
(	0.894	0.505	0.27	)				
(	0.894	0.529	0.27	)				
(	0.894	0.553	0.27	)				
(	0.894	0.577	0.27	)				
(	0.894	0.601	0.27	)				
(	0.894	0.625	0.27	)				
(	0.894	0.649	0.27	)				
(	0.894	0.673	0.27	)				
(	0.894	0.697	0.27	)				
(	0.894	0.721	0.27	)				
(	0.894	0.745	0.27	)				
								
(	0.894	0.001	0.29	)				
(	0.894	0.025	0.29	)				
(	0.894	0.049	0.29	)				
(	0.894	0.073	0.29	)				
(	0.894	0.097	0.29	)				
(	0.894	0.121	0.29	)				
(	0.894	0.145	0.29	)				
(	0.894	0.169	0.29	)				
(	0.894	0.193	0.29	)				
(	0.894	0.217	0.29	)				
(	0.894	0.241	0.29	)				
(	0.894	0.265	0.29	)				
(	0.894	0.289	0.29	)				
(	0.894	0.313	0.29	)				
(	0.894	0.337	0.29	)				
(	0.894	0.361	0.29	)				
(	0.894	0.385	0.29	)				
(	0.894	0.409	0.29	)				
(	0.894	0.433	0.29	)				
(	0.894	0.457	0.29	)				
(	0.894	0.481	0.29	)				
(	0.894	0.505	0.29	)				
(	0.894	0.529	0.29	)				
(	0.894	0.553	0.29	)				
(	0.894	0.577	0.29	)				
(	0.894	0.601	0.29	)				
(	0.894	0.625	0.29	)				
(	0.894	0.649	0.29	)				
(	0.894	0.673	0.29	)				
(	0.894	0.697	0.29	)				
(	0.894	0.721	0.29	)				
(	0.894	0.745	0.29	)				
								
(	0.894	0.001	0.31	)				
(	0.894	0.025	0.31	)				
(	0.894	0.049	0.31	)				
(	0.894	0.073	0.31	)				
(	0.894	0.097	0.31	)				
(	0.894	0.121	0.31	)				
(	0.894	0.145	0.31	)				
(	0.894	0.169	0.31	)				
(	0.894	0.193	0.31	)				
(	0.894	0.217	0.31	)				
(	0.894	0.241	0.31	)				
(	0.894	0.265	0.31	)				
(	0.894	0.289	0.31	)				
(	0.894	0.313	0.31	)				
(	0.894	0.337	0.31	)				
(	0.894	0.361	0.31	)				
(	0.894	0.385	0.31	)				
(	0.894	0.409	0.31	)				
(	0.894	0.433	0.31	)				
(	0.894	0.457	0.31	)				
(	0.894	0.481	0.31	)				
(	0.894	0.505	0.31	)				
(	0.894	0.529	0.31	)				
(	0.894	0.553	0.31	)				
(	0.894	0.577	0.31	)				
(	0.894	0.601	0.31	)				
(	0.894	0.625	0.31	)				
(	0.894	0.649	0.31	)				
(	0.894	0.673	0.31	)				
(	0.894	0.697	0.31	)				
(	0.894	0.721	0.31	)				
(	0.894	0.745	0.31	)				
								
(	0.894	0.001	0.33	)				
(	0.894	0.025	0.33	)				
(	0.894	0.049	0.33	)				
(	0.894	0.073	0.33	)				
(	0.894	0.097	0.33	)				
(	0.894	0.121	0.33	)				
(	0.894	0.145	0.33	)				
(	0.894	0.169	0.33	)				
(	0.894	0.193	0.33	)				
(	0.894	0.217	0.33	)				
(	0.894	0.241	0.33	)				
(	0.894	0.265	0.33	)				
(	0.894	0.289	0.33	)				
(	0.894	0.313	0.33	)				
(	0.894	0.337	0.33	)				
(	0.894	0.361	0.33	)				
(	0.894	0.385	0.33	)				
(	0.894	0.409	0.33	)				
(	0.894	0.433	0.33	)				
(	0.894	0.457	0.33	)				
(	0.894	0.481	0.33	)				
(	0.894	0.505	0.33	)				
(	0.894	0.529	0.33	)				
(	0.894	0.553	0.33	)				
(	0.894	0.577	0.33	)				
(	0.894	0.601	0.33	)				
(	0.894	0.625	0.33	)				
(	0.894	0.649	0.33	)				
(	0.894	0.673	0.33	)				
(	0.894	0.697	0.33	)				
(	0.894	0.721	0.33	)				
(	0.894	0.745	0.33	)				
								
(	0.894	0.001	0.35	)				
(	0.894	0.025	0.35	)				
(	0.894	0.049	0.35	)				
(	0.894	0.073	0.35	)				
(	0.894	0.097	0.35	)				
(	0.894	0.121	0.35	)				
(	0.894	0.145	0.35	)				
(	0.894	0.169	0.35	)				
(	0.894	0.193	0.35	)				
(	0.894	0.217	0.35	)				
(	0.894	0.241	0.35	)				
(	0.894	0.265	0.35	)				
(	0.894	0.289	0.35	)				
(	0.894	0.313	0.35	)				
(	0.894	0.337	0.35	)				
(	0.894	0.361	0.35	)				
(	0.894	0.385	0.35	)				
(	0.894	0.409	0.35	)				
(	0.894	0.433	0.35	)				
(	0.894	0.457	0.35	)				
(	0.894	0.481	0.35	)				
(	0.894	0.505	0.35	)				
(	0.894	0.529	0.35	)				
(	0.894	0.553	0.35	)				
(	0.894	0.577	0.35	)				
(	0.894	0.601	0.35	)				
(	0.894	0.625	0.35	)				
(	0.894	0.649	0.35	)				
(	0.894	0.673	0.35	)				
(	0.894	0.697	0.35	)				
(	0.894	0.721	0.35	)				
(	0.894	0.745	0.35	)				
(	0.894	0.001	0.35	)				
(	0.894	0.025	0.35	)				
(	0.894	0.049	0.35	)				
(	0.894	0.073	0.35	)				
(	0.894	0.097	0.35	)				
(	0.894	0.121	0.35	)				
(	0.894	0.145	0.35	)				
(	0.894	0.169	0.35	)				
(	0.894	0.193	0.35	)				
(	0.894	0.217	0.35	)				
(	0.894	0.241	0.35	)				
(	0.894	0.265	0.35	)				
(	0.894	0.289	0.35	)				
(	0.894	0.313	0.35	)				
(	0.894	0.337	0.35	)				
(	0.894	0.361	0.35	)				
(	0.894	0.385	0.35	)				
(	0.894	0.409	0.35	)				
(	0.894	0.433	0.35	)				
(	0.894	0.457	0.35	)				
(	0.894	0.481	0.35	)				
(	0.894	0.505	0.35	)				
(	0.894	0.529	0.35	)				
(	0.894	0.553	0.35	)				
(	0.894	0.577	0.35	)				
(	0.894	0.601	0.35	)				
(	0.894	0.625	0.35	)				
(	0.894	0.649	0.35	)				
(	0.894	0.673	0.35	)				
(	0.894	0.697	0.35	)				
(	0.894	0.721	0.35	)				
(	0.894	0.745	0.35	)

            );
    
            // Fields to be probed
            fields ( p U alpha1 );
    
            // Write at same frequency as fields
            outputControl   timeStep;
            outputInterval  1;
    }
}

// ************************************************************************* //
