OpenFOAM_Benchmarks/dambreakGomez/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.4 0.3 1);
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
        
    }
    
    boxToCell
    {
        box (0.4 0 -1) (1.6 0.01 1);
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }   
);



// ************************************************************************* //
